BrunoRicci/DataloggerDHT22/Firmware/code_esp8266_dht22/src/main.cpp
  }






  //Waits for WiFi connection
/*   if ((WiFiMulti.run() == WL_CONNECTED)) {
    Serial.printf("WiFi Connected!");
    
    WiFiClient client;
    HTTPClient http;
  
    Serial.print("[HTTP] begin...\n");
    if (http.begin(client, "http://192.168.0.172:8080/sendmeasurements")) {  // HTTP
      String request;

      
      //Send POST request
      Serial.print("[HTTP] POST...:\n");
      Serial.print(request);
      int httpCode = http.POST( request );
      //int httpCode = http.GET();

      // httpCode will be negative on error
      if (httpCode > 0) {
        // HTTP header has been send and Server response header has been handled
        Serial.printf("[HTTP] POST... code: %d\n", httpCode);
        
        // file found at server
        if (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY) {
          String payload = http.getString();
          Serial.println(payload);
        }

        goDeepSleep(60e6);  //Deep sleep for low power consumption.

      } else {
        Serial.printf("[HTTP] GET failed, error: %s\n", http.errorToString(httpCode).c_str());
        goDeepSleep(60e6);
      }
      http.end();
    } 
    else {
      Serial.printf("[HTTP] Unable to connect\n");
      goDeepSleep(60e6);  //Deep sleep for low power consumption.
    }
  } 
*/

  
}

void portInit(void){
  pinMode(PWR_SENSORS_PIN, OUTPUT);   //GPIO12 as output
  pinMode(PWR_CONTROL_PIN, OUTPUT);
  pinMode(14, INPUT);
  pinMode(15, OUTPUT);
  pinMode(13, OUTPUT);
  pinMode(PWR_CONTROL_PIN, OUTPUT);
  digitalWrite(PWR_CONTROL_PIN,HIGH);
  digitalWrite(15,LOW);
  digitalWrite(13,HIGH);
  setSensorPower(OFF);          //Sensors start turned off.
}

void setBatteryState(uint8 state){
  if (state == ON)
  {
    digitalWrite(PWR_CONTROL_PIN, HIGH);
    pinMode(PWR_CONTROL_PIN, OUTPUT);
  }
  else if (state == OFF)
  {
    pinMode(PWR_CONTROL_PIN, OUTPUT);
    digitalWrite(PWR_CONTROL_PIN, LOW);
  }  
}

uint8_t getBatteryLevel(void){
  uint16_t voltage = (uint16_t)((analogRead(BATTERY_SENSE_PIN))*(ADC_VOLTAGE_MV/1023));
  uint16_t real_voltage = (uint16_t)((float)(voltage*VBAT_VADC_RATIO));   //Actual voltage before divider.
  // Serial.printf("\nReal voltage = %dmV" ,real_voltage);
  uint8_t percentage = ( ((real_voltage - BATTERY_MIN_VOLTAGE)*100) / (BATTERY_MAX_VOLTAGE-BATTERY_MIN_VOLTAGE) );
  // Serial.printf("\nPercentage: %d" ,percentage);

  return percentage;  //Returns battery percentage.
}

bool checkBattery(void){
  if (getBatteryLevel() >= BATTERY_MIN_PERCENTAGE) 
    return true;    
  else            //when out of battery
    return false;     
}

bool isCharging(void){
  //Returns true if the device is being charged.
  setSensorPower(OFF);    //Sensors must be powered off in order to detect the charger properly.
  if ( digitalRead(CHARGER_DETECT_PIN) )  //
   { Serial.print("\nCharging.");
     return true;}
  else
   { Serial.print("\nNot charging.");
   return false; } 
}

bool reedSwitchIsPressed(void){
  //Returns true if reed switch is pressed (when GPIO associated is in logic 1).
  if(digitalRead(REED_SWITCH_PIN))  return true;
  else  return false;
}

bool writeDataToFlash(String path, void* data, unsigned int bytes) { // send the right file to the client (if it exists)
  //todo: validate data and bytes parameters. ALso chech if path exists to avoid creating multiple files unnecessarily.
  
  Serial.printf("\n\n Data to write to flash:\n  buf=");
  for (uint16 i = 0; i < bytes; i++)
  {
    Serial.printf("%X ", ((const char*)data)[i]);
  }

  File file = SPIFFS.open(path, "a"); //Opens file specified in path parameter to write.
  if (!file) {    //If file is unable to open...
    Serial.println("Error opening file for writing");
    return false;
  }
  else{     //If file opened correctly...
    
    // Serial.printf("\nCursor position at %d",file.seek(0,fs::SeekEnd));     //Put cursor to the end of the file.
    unsigned int pos = 0;//file.position();
    int bytesWritten = file.write((const char*)data,bytes);
    // int bytesWritten = file.printf("measurement: %d\n",millis());
    if (bytesWritten > 0) {
        Serial.printf("\nFile was written in position %d, %d bytes", pos, bytesWritten);
    } else {
      Serial.println("\nFile write failed");
    }
    file.close();
    return true;
  }
}

bool readDataFromFlash(String path, uint32_t index, void* data, unsigned int bytes){

  File file = SPIFFS.open(path, "r");   //Open file

  if (!file) {
    Serial.println("Failed to open file for reading");
    return false;
  }
  else{
    file.seek(index, fs::SeekSet);    //Move the cursor "index" bytes from the beginning.
    uint16 currpos = file.position();
    Serial.printf("\ncurrpos = %d\n", currpos);
    for (uint16 i = 0; i < bytes; i++)  //Read "bytes" number of bytes from the index position. 
    {
      ((uint8_t*)data)[i] = file.read(); 
      Serial.printf("%X ",((uint8_t*)data)[i]); //Prints file content.
    } 

    file.close();    //Close file.
    return true;
  }
}

bool archiveWrite(void* data, uint16_t bytes){
  //Write "bytes" number of packets into the archive (flash memory).
  if(bytes >= RTC_MEMORY_MEASUREMENT_BLOCK_SIZE){
    
    Serial.printf("\n\n Data to write to archive:\n  buf=");
    for (uint16 i = 0; i < bytes; i++)
    {
      Serial.printf("%X ", ((const char*)data)[i]);
    }

    File file = SPIFFS.open(MEASUREMENTS_FILE_NAME, "a"); //Opens archive file to append measurements.
      // file.size();
    if (file) {    //If file opened correctly...
      
      int bytesWritten = file.write((const char*)data,bytes);

      if (bytesWritten == bytes) {  //If every byte is written...
        rtcmem.var.archive_saved_pointer=archiveGetPointer();   //Move pointer.
        rtcmem.rwVariables();
        Serial.printf("\nFile was written, %d bytes",bytesWritten);
      }else {
        Serial.println("\nFile write failed");
        file.close();
        return false;
      }
      file.close();
      return true;
    }
    else{        //If file is unable to open...
      Serial.println("Error opening file for writing");
      
