BrunoRicci/DataloggerDHT22/Firmware/code_esp8266_dht22/src/main.cpp
    }
  }
  return false;
}

bool archiveRead(void* data, uint32_t first_packet, uint32_t last_packet){

  //Read archive from one packet index to other. "start index" is the first reference and "end_index" the last one.
  //This function will copy the content from the first packet in the archive to the last one, including both
  //mentioned packets and each one between them, in the order they are saved into the archive.
  //If both indexes are equal, only one packet is read.
    
  //Validate that the index values are both multiple of RTC_MEMORY_MEASUREMENT_BLOCK_SIZE (24)!!
  
  uint32_t packet_amount = 1+(last_packet-first_packet);
  uint32_t total_bytes = packet_amount*RTC_MEMORY_MEASUREMENT_BLOCK_SIZE*RTC_MEMORY_BLOCK_SIZE;
  if ( first_packet >= 0 && last_packet >= 0 && (packet_amount >= 0))  //If packets indexes are valid...
  {
    File file = SPIFFS.open(MEASUREMENTS_FILE_NAME, "r");   //Open file
    if (file){        //If file opens correctly...
      //If file end is not going to be reached...
      if( file.available() >= total_bytes )
      { 
          file.seek(first_packet*sizeof(Measurement),
                    fs::SeekSet);    //Move the cursor to the first_packet position.
          Serial.printf("archiveRead() first_packet: %d, last_packet: %d,   seek value:%d", first_packet, last_packet, first_packet*sizeof(Measurement));
          Serial.printf("\nData read from archive:   (currpos = %d)\n", file.position());   //For debugging...
          
          for (uint32 i = 0; i < total_bytes; i++)    //Writes data output buffer
          {
            ((uint8_t*)data)[i] = file.read(); 
            Serial.printf("%X ",((uint8_t*)data)[i]); //Prints file content.                //For debugging...  
          }
      }
      file.close();    //Close file.
      return true;
    }
    else{         //If file fails to open...
      Serial.println("Failed to open file for reading");
      return false;
    }
  }
  else
  {
    return false;
  }
}

uint32_t archiveGetPointer(void){
  //Return position of pointer, where next packet will be written.
  uint32_t size = 0;
  File file = SPIFFS.open(MEASUREMENTS_FILE_NAME, "r");   //Open file
    if (file){        //If file opens correctly...
      size = file.size();
      file.close();    //Close file.
      // Serial.printf("\nFile size = %d)\n", size);   //For debugging...
    }
  return (1+size/(RTC_MEMORY_MEASUREMENT_BLOCK_SIZE*RTC_MEMORY_BLOCK_SIZE));   
}

Measurement getMeasurements(void){
  //Turns sensors on, take measurements, format them and return.
  Measurement m;
  dht22_sensor_1.begin();           //Initializes objects.
  dht22_sensor_2.begin();
  dht22_sensor_3.begin();
  dht22_sensor_4.begin();

  setSensorPower(ON);
  delay(1000);  
  //GET MEASUREMENTS
  m.timestamp=rtcmem.getCurrentTime();  //Put current timestamp
  m.id_sensor[0] = 1;   //Read sensor number from configuration file.
  m.id_sensor[1] = 2; 
  m.id_sensor[2] = 3; 
  m.id_sensor[3] = 4;
  m.temperature[0] = generateMeasurementValue(TEMPERATURE, dht22_sensor_1.readTemperature());
  m.temperature[1] = generateMeasurementValue(TEMPERATURE, dht22_sensor_2.readTemperature());
  m.temperature[2] = generateMeasurementValue(TEMPERATURE, dht22_sensor_3.readTemperature());
  m.temperature[3] = generateMeasurementValue(TEMPERATURE, dht22_sensor_4.readTemperature());
  m.humidity[0] = generateMeasurementValue(HUMIDITY, dht22_sensor_1.readHumidity());; 
  m.humidity[1] = generateMeasurementValue(HUMIDITY, dht22_sensor_2.readHumidity());; 
  m.humidity[2] = generateMeasurementValue(HUMIDITY, dht22_sensor_3.readHumidity());; 
  m.humidity[3] = generateMeasurementValue(HUMIDITY, dht22_sensor_4.readHumidity());;  

  setSensorPower(OFF);

  return(m);
}

String generatePOSTRequest( uint16_t id_transceiver, uint8_t battery_level,   //Header elements
                            uint32_t *timestamp,  //Array elements
                            uint16_t *id_sensor,
                            int16_t *temperature,
                            uint32_t *humidity,
                            uint8_t length        //Number of elements to be sent.
                            ){
  /*This function receives data saved to flash (array) and generates the POST request to send
    it to the server, which is returned.
    Necessary data:
      -id_transceiver
      -battery_level
        -timestamp[]
        -id_sensor[]
        -temperature[]
        -humidity[]
  */


  String request = "";  //Initialize empty string.

  String aux_string;


  //request= "t1=1&t2=2&t3=3&t4=4&h1=1&h2=2&h3=3&h4=4";
      //formatMeasurementValue(TEMPERATURE, temperature[0]);

       
      request += "id_transceiver=1";
      request += "battery_level=100";
      request += "timestamp=[,,,,,,,]";
      request += "id_sensor=[1,2,3,4,1,2,3,4]";
      request += "temperature=[19.7,19.5,20.2,19.5,20.2,21.0,20.5,20.7]";
      request += "humidity=[35,39,35,40,43,46,48,45]"; 
      

     /*  request+= "t1=";
      request+= formatMeasurementValue(TEMPERATURE, dht22_sensor_1.readTemperature());
      request+= "&t2=";
      request+= formatMeasurementValue(TEMPERATURE, dht22_sensor_2.readTemperature());
      request+= "&t3=";
      request+= formatMeasurementValue(TEMPERATURE, dht22_sensor_3.readTemperature());
      request+= "&t4=";
      request+= formatMeasurementValue(TEMPERATURE, dht22_sensor_4.readTemperature());
      request+= "&h1=";
      request+= formatMeasurementValue(HUMIDITY, dht22_sensor_1.readHumidity());
      request+= "&h2=";
      request+= formatMeasurementValue(HUMIDITY, dht22_sensor_2.readHumidity());
      request+= "&h3=";
      request+= formatMeasurementValue(HUMIDITY, dht22_sensor_3.readHumidity());
      request+= "&h4=";
      request+= formatMeasurementValue(HUMIDITY, dht22_sensor_4.readHumidity());
    */
  // temperature_float[0] = dht22_sensor_1.readTemperature();
  // temperature_float[1] = dht22_sensor_2.readTemperature();
  // temperature_float[2] = dht22_sensor_3.readTemperature();
  // temperature_float[3] = dht22_sensor_4.readTemperature();
  // humidity_float[0] = dht22_sensor_1.readHumidity();
  // humidity_float[1] = dht22_sensor_2.readHumidity();
  // humidity_float[2] = dht22_sensor_3.readHumidity();
  // humidity_float[3] = dht22_sensor_4.readHumidity();
  return request;
}

uint32_t getServerTimeUnix(void){
  //Cnnects to server, sends a request and returns unix time in UTC from server.
}

